tutorials/fluidSolidInteraction/TurekHron2006/Allrun
#!/bin/bash

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Source solids4Foam scripts
source solids4FoamScripts.sh

# Example usage
# ./Allrun                 # default behaviour is FSI3 with Dirichlet-Neumann IQN-ILS
# ./Allrun fsi1            # steady FSI1 benchmark
# ./Allrun fsi2            # periodic FSI2 benchmark
# ./Allrun robin           # Robin-Neumann coupling
# ./Allrun parallel
# ./Allrun fsi2 robin parallel

coupling=iqnils
interfaceCondition=dirichletNeumann
runMode=serial
benchmark=

for arg in "$@"
do
    case "$arg" in
        fsi1|FSI1|fsi2|FSI2|fsi3|FSI3)
            benchmark=$(printf '%s' "$arg" | tr '[:upper:]' '[:lower:]')
            ;;
        iqnils|IQNILS)
            coupling=iqnils
            interfaceCondition=dirichletNeumann
            ;;
        robin|Robin)
            coupling=robin
            interfaceCondition=robin
            ;;
        parallel)
            runMode=parallel
            ;;
        *)
            echo "Unknown option: $arg"
            echo "Usage: ./Allrun [fsi1|fsi2|fsi3] [iqnils|robin] [parallel]"
            exit 1
            ;;
    esac
done

echo "Using ${coupling} coupling setup"

# Set the inflow, plate material and run control of the requested benchmark.
# The stored case is FSI3; the edited dictionaries are restored on exit.
benchmarkFiles="0/fluid/U.dirichletNeumann 0/fluid/U.robin \
constant/solid/mechanicalProperties system/controlDict \
constant/fsiProperties.iqnils constant/fsiProperties.robin system/fluid/fvSolution"

restore_benchmark()
{
    for file in $benchmarkFiles
    do
        if [[ -f "${file}.stored" ]]
        then
            mv -f "${file}.stored" "${file}"
        fi
    done
}

# A backup left by an interrupted benchmark run holds the stored
# dictionaries, and the case files still hold that benchmark's settings
if [[ -n $(find 0 constant system -name '*.stored') ]]
then
    echo "A *.stored backup exists from an interrupted run:"
    echo "run ./Allclean to restore the stored case first"
    exit 1
fi

if [[ -n "$benchmark" ]]
then
    case "$benchmark" in
        fsi1)
            # Steady: mean inflow 0.2 m/s ramped over 2 s, run as a
            # pseudo-transient route to the steady state. The loads are
            # 30 to 40 times smaller than in FSI3, so the fluid solver
            # tolerances are tightened. The interface tolerance stays at the
            # stored 1e-5, that of the verification study: do not tighten it
            # to 1e-6, at which the solver residuals stall IQN-ILS just above
            # the tolerance
            maxValue=0.3; transitionPeriod=2; rho=1000; E=1.4e6
            deltaT=0.025; endTime=30; writeInterval=40
            outerCorrTolerance=1e-5; fluidTolerance=1e-9
            ;;
        fsi2)
            # Periodic with large deformation: mean inflow 1 m/s ramped over
            # 2 s and a heavy, soft plate
            maxValue=1.5; transitionPeriod=2; rho=10000; E=1.4e6
            deltaT=1e-3; endTime=10.5; writeInterval=100
            outerCorrTolerance=1e-6; fluidTolerance=1e-6
            ;;
        fsi3)
            # Periodic: mean inflow 2 m/s applied without a ramp
            maxValue=3; transitionPeriod=0; rho=1000; E=5.6e6
            deltaT=1e-3; endTime=6; writeInterval=20
            outerCorrTolerance=1e-5; fluidTolerance=1e-6
            ;;
    esac
    echo "Setting up the ${benchmark} benchmark"

    solids4Foam::requireGnuSed
    for file in $benchmarkFiles
    do
        cp "${file}" "${file}.stored" || exit 1
    done
    trap restore_benchmark EXIT

    for file in 0/fluid/U.dirichletNeumann 0/fluid/U.robin
    do
        "${SOLIDS4FOAM_SED}" -i \
            -e "s/^\(\s*maxValue\s\+\)[^;]*;/\1${maxValue};/" \
            -e "s/^\(\s*transitionPeriod\s\+\)[^;]*;/\1${transitionPeriod};/" \
            "${file}"
    done
    "${SOLIDS4FOAM_SED}" -i \
        -e "s/^\(\s*rho\s\+rho \[[^]]*\] \)[^;]*;/\1${rho};/" \
        -e "s/^\(\s*E\s\+E \[[^]]*\] \)[^;]*;/\1${E};/" \
        constant/solid/mechanicalProperties
    "${SOLIDS4FOAM_SED}" -i \
        -e "s/^\(deltaT\s\+\)[^;]*;/\1${deltaT};/" \
        -e "s/^\(endTime\s\+\)[^;]*;/\1${endTime};/" \
        -e "s/^\(writeInterval\s\+\)[^;]*;/\1${writeInterval};/" \
        system/controlDict
    "${SOLIDS4FOAM_SED}" -i \
        -e "s/^\(\s*outerCorrTolerance\s\+\)[^;]*;/\1${outerCorrTolerance};/" \
        constant/fsiProperties.iqnils constant/fsiProperties.robin
    "${SOLIDS4FOAM_SED}" -i \
        -e "s/^\(\s*tolerance\s\+\)[^;]*;/\1${fluidTolerance};/" \
        system/fluid/fvSolution
fi

ln -vnsf "fsiProperties.${coupling}" constant/fsiProperties
ln -vnsf "U.${interfaceCondition}" 0/fluid/U
ln -vnsf "p.${interfaceCondition}" 0/fluid/p

# Check case version is correct
solids4Foam::convertCaseFormat .

# Create meshes
solids4Foam::runApplication -s solid blockMesh -region solid
solids4Foam::runApplication -s fluid blockMesh -region fluid

# Run solver
if [[ "$runMode" == "parallel" ]]; then
    # Run parallel
    solids4Foam::runApplication -s fluid decomposePar -region fluid
    solids4Foam::runApplication -s solid decomposePar -region solid
    solids4Foam::runParallel solids4Foam
    solids4Foam::runApplication -s fluid reconstructPar -region fluid
    solids4Foam::runApplication -s solid reconstructPar -region solid
else
    # Run serial
    solids4Foam::runApplication solids4Foam
fi

# Create plots
if command -v gnuplot &> /dev/null
then
    echo "Generating deflection.pdf using gnuplot"
    gnuplot deflection.gnuplot &> /dev/null
    if [ $(find postProcessing forces -type f \
        \( -name force.dat -o -name forces.dat \) 2>/dev/null | wc -l) -eq 1 ]
    then
        echo "Generating force.pdf using gnuplot"
        gnuplot force.gnuplot &> /dev/null
    fi
else
    echo "Please install gnuplot if you would like to generate the plots"
fi
