tutorials/fluidSolidInteraction/TurekHron2006/constant/fsiProperties
fsiProperties.iqnils